import { iArticle } from "../src/shared/interfaces";

// Import author profiles, just type the name you have set in _BLOG_SETUP inside the curly brackets
import { MAYUR, RUPALI } from "./_BLOG_SETUP";

// main article list to display all atricles
/**
 * Example article object
 * 
 {
    path: '/pages/tutorial/tutorial/how-to-setup-blog',
    featureArticle: true,
    preview: {
        // the author object you created in _BLOG_SETUP file
        author: MAYUR,
        date: "March 03 2022",
        articleTitle: "How to setup this plog template",
        tags: "demo, blog setup",
        thumbnail: "/images/tutorials/demo-image.jpg",
        shortIntro: "These are the steps to setup your blog",
    },
    seo: {
        title: "These are the steps to setup your blog",
        description:
            "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua",
        keywords: "demo, blog setup",
        ogImage: "/images/tutorials/demo-image.jpg",
        twitterHandle: "@mayur_nalwala",
    }
}
 */
// clear this article list and add your own
export const ARTICLES_LIST: iArticle[] = [
  {
    id: '251124',
    path: "/blog/251124",
    preview: {
      author: RUPALI,
      date: "11-24-2025",
      articleTitle: "道一關懷協會第二屆第四次理監事聯席會暨道一道務會議",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/251124/1.jpg",
      shortIntro:
        "本會於11/24（一）在礁溪溫泉公園舉行第二屆第四次理監事會議，並舉辦敬老活動。感謝何理事長致詞：本次舉辦二日遊的第二天在戶外開會是很不錯的體驗，每年也多有敬老活動，希望大家長長久久，希望明年協會的會務工作能更順利推動。感謝諸位理監事撥冗共襄盛舉並參與會議。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/251124/1.jpg",
    },
  },
  {
    id: '251109',
    path: "/blog/251109",
    preview: {
      author: RUPALI,
      date: "11-09-2025",
      articleTitle: "許瓊月講師慈悲成全，題目：「抱一為天下式」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/251109/1.jpg",
      shortIntro:
        "道一綜合班由乾道青年獻供后，邀請鄧壇主慈悲帶動大家做運動；感謝何點傳師致詞，鼓勵同修多參與聯誼，多國外了愿。外聘許瓊月講師慈悲成全，題目：「抱一為天下式」；#前言～地球在宇宙中是個小點，人更顯得很渺小，是一粒懸浮在陽光下的微塵。內容：老子道德經22章：「曲則全，枉則直；窪則盈，敝則新；少則得，多則惑。是以『聖人抱一為天下式』。不自見故明，不自是故彰，不自伐故有功，不自矜故長。夫唯不爭，故天下莫能與之爭。古之所謂曲則全者，豈虛言哉！誠全而歸之。」李白：夫天地者萬物之逆旅。光陰者，百代之過客。而浮生若夢，為歡幾何？不昧因果，修性了命；吴老前人：人生如戲，大家都是戲台上的不同的角色。演完一場換換行頭又是一場，就這樣演出了許多悲歡離合等場面。前台與後台，開場與落幕，走來走去，實際上還是同一個人！吴老前人；人生是苦，不論多麼苦，只苦一世，並算不了什麽；永遠解脱不了的輪迴之苦，方是真苦。最可悲是，認苦為樂的人，甘為物役，忘記自己是誰了！如覺悟輪迴是苦，就從此莫種業因並以功德報償業果。道親守中先回到方寸密室之中，就能終日煉神光，萬法歸一，最後會發現自己心就是處於無所住的狀態，就是破無明。德感謝天恩師德，求道讓我們先得後修，找到真正的自己，我們要誠心保守。人生像碗一樣。裝得了濃濃的山珍海味，也盛得輕輕的粗茶淡飯，無論裝得多麼的地滿，最後仍是要空空空。感謝良純、子熏、廷凱輔導兒童讀「三字經」，感謝莊太太、李太太、林太太、劉太太和淑琴前賢廚務準備豐盛午餐。感謝諸位大德護持參加班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/251109/1.jpg",
    },
  },
  {
    id: '251012',
    path: "/blog/251012",
    preview: {
      author: RUPALI,
      date: "10-12-2025",
      articleTitle: "第一節邀請何良純講師慈悲成全，題目：「放下我執」，第二節邀請劉美均講師慈悲成全題目：「以愿力投入道場」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/251012/1.jpg",
      shortIntro:
        "道一綜合班會由坤道青年獻果，感謝鄧壇主慈悲帶動前賢做運動。第一節邀請何良純講師慈悲成全，題目：「放下我執」，從固執與我執，走向智慧的堅持，莊子逍遙遊：「木直中繩，輮以為輪，其曲中規。此是柔軟智慧，剛中帶軟。佛陀喻水～「人生的痛苦如鹽的鹹味，是否苦，就看你的心像杯子還是像河流。」所以要覺察，要問自己，「我」是在執著什麼？要轉化，先聽他人怎麼說，不被自我與情緒綁住，乃能保持清明與慈悲。而後要穩定，讓堅持成為心的修行。智慧的埾持，是從容的、內在穩定的、不躁不急。第二節邀請劉美均講師慈悲成全題目：「以愿力投入道場」。我們到佛堂第一項工作就是要參駕，佛堂的擺設，如果不是佛像，而是個「大鏡子」。那麼它意會著什麼？它-就是要我們自己「觀照」、「覺察」，看看自己到佛堂除聽課外，我為道場做了些什麼？其實場道有許多可以了愿學習的地方。重要的是「發愿」，愿-是對於心境的昇華。愿-於個人是一種激勵。愿-於道務是一種牽引。愿-於道場是一種共力。愿-對上帝是一種承諾。愿力是一生一世的承諾，是無時空的限制。愿-對於使命是一種忠貞。愿-對於冤孽是一種信任。對於冤欠債主要去償還的，就是發了「愿」，去行愿、了愿而後做廻向。愿-對於祖先是一種安慰。當立下清囗愿後，祖先即可帶小蓮花在地藏菩薩地方聽課，也因爲你來佛堂的入班，你的祖先亦可在佛堂旁聽。所以如果沒有「道愿」，所做的所存的就會告訴自己，做這個也沒關係、做那個也沒關係，你就不會堅持、持續不斷的走下去，所以立愿是非常重要的。感謝良萱、良純、子薰等慈悲引導兒童班讀三字經，感謝二位陳太太、胡太太、洪大嫂、吳太太等慈悲準備豐盛午餐，感謝諸位前賢參加護持班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/251012/1.jpg",
    },
  },
  {
    id: '250824',
    path: "/blog/250824",
    preview: {
      author: RUPALI,
      date: "08-24-2025",
      articleTitle: "道一關懷協會第二屆第三次理監事聯席會",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250824/1.jpg",
      shortIntro:
        "今日早上舉行「道一關懷協會第二屆第三次理監事聯席會」，感謝何明修理事長致詞：鼓勵大家踴躍參與各項慈善活動，都能盡心盡力。各位理監事踴躍出席並且提出寶貴的意見。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250824/1.jpg",
    },
  },
  {
    id: '250810',
    path: "/blog/250810",
    preview: {
      author: RUPALI,
      date: "08-10-2025",
      articleTitle: "邀請黃子薰講師慈悲成全，題目：「修道修心」與 黃坤紅講師慈悲成全，題目：「大學之道」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250810/1.jpg",
      shortIntro:
        "道一綜合班由坤道（青年）獻果，獻果後邀請鄧琴鍵壇主慈悲帶動大家做運動；第一節邀請黃子薰講師慈悲成全，題目：「修道修心」，第二節邀請黃坤紅講師慈悲成全，題目：「大學之道」。感謝陳領導點傳師慈悲關心與指導。內容：何為修道修心？，修道→是我們的每日功課。目標→把人心、血心修成道心。要在哪裡修→日常生活中。要如何修→各自有不同心法。道心～至善之心-慈悲心、智慧心。人心～可善可惡-分别之心、受到六根六塵的影響。血心～惡心-物慾之心(身口意)。在修心之前要先反省、反思、內自省，照看自己的心，自我覺察心之動念與息滅。修道修心～短期焦點取向太極圖；1.陰陽相對。2.陰陽消長，動態平衡。3.陰中有陽，陽中有陰。4.痛苦及希望改變是一直發生的。要找到自己的內在資源（希望、情緒調節、價值觀），外在的資源（指引心的方向-三不離）。修道很不容易，有順、有逆、不要被困境打敗。內容：大學之道，在明明德，在親親，在新民，在止於至善。至善～吾人之本性（佛，性）明明德，明性體；在親親，親於自性良知，為君子者公義之心，小人者自私自利。人的起心動念很重要、好的心念就有好的磁場、衆多的心念一動，就產生共振，所以修道在親親，從修自己的心修起，自心修好才會有新民之功，把自己的脾氣毛病改變。感謝子萱、苰玄、于萱等慈悲引導兒童讀三字經，感謝二位林太太、陳太太、洪太太以及素柔姐等慈悲準備豐盛午餐，感謝諸位前賢參加護持班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250810/1.jpg",
    },
  },
  {
    id: '250622',
    path: "/blog/250622",
    preview: {
      author: RUPALI,
      date: "06-22-2025",
      articleTitle: "道一經典班邀請李瑞慶講師慈悲成全「金剛經」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250622/1.jpg",
      shortIntro:
        "今日道一佛堂經典班會，由坤道前賢獻供，邀請李瑞慶講師慈悲成全「金剛經」～先從前第一分至七分做重點提示，後續講八、九分。感謝陳領導點傳師慈悲關心與指導；內容：一、離言說的正法→ （示妙分）1、著衣→忍辱。2、持鉢→戒食。3、乞食→掃除三心。4、次第行乞→衆生平等。5、還至本處飲食訖→戒律不亂。6、收衣鉢→心無掛慮。7、洗足已→除塵清淨身業。8、敷坐而坐、現其實相。二、須菩提當機啟請，請佛「指授般若正法」→ （求道分）1、云何應住→菩提心常住不退。2、云何降伏其心→妄想心降伏不起。三、大乘正宗→ （離相），正宗→悟六庋萬行法，不住四相，降心之法。別宗→聲聞（小乘）、緣覺（中乘）。四、妙行無住→ （無住），無住是妙行，率性之謂道。五、如理實現→不執相不以相見1、不可以身相如來，如四句偈也。六、正信希有。不執法（法不可取），一念生淨信者，得如是無量福德。七、無得無說→佛即不可見、法不可取。如來說法皆是應機說法，真道本是離文字言說，秘密心傳的不可說。所以者何？一切賢聖，皆以無為法，而有差別。八、依法出生→福德與福德性之差別。依無為法始可往生，「云何應住，云何降伏其心，應如是住，應如是降伏其心。」除「四句偈」之實相外，其他之一切文字言說皆是佛法。感謝良純、子薰等前賢輔導兒童製作美勞。感謝廚務莊太太、胡太太、王太太、芳宜、桂媚前賢烹調豐盛午餐。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250622/1.jpg",
    },
  },
  {
    id: '250621',
    path: "/blog/250621",
    preview: {
      author: RUPALI,
      date: "06-21-2025",
      articleTitle: "古坑陳氏佛堂班會邀請劉美均講師慈悲成全",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250621/1.jpg",
      shortIntro:
        "古坑陳氏佛堂班會邀請劉美均講師慈悲成全，題目：「快樂的壇主人才」。內容：人常常覺得自己的人生還有缺憾，汲汲營營追求、尋找失落的那一角。卻不知道真正的圓滿不在外求富貴名利健康婚姻，而在內心的知足、找到今生的目標🎯：知道從何而來、將來要回到哪裡。「認真」生活的要義，是要先認「真」（認性我我、認理為真）掌握好方向才能不枉此生。陳點傳師慈悲八識心要，「大圓鏡智性清淨，平等性智心無病，妙觀察智見非功，成所作智同圓鏡，五八六七果因轉，但用名言無實性。若於轉處不留情，繁興永處那伽定。」",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250621/1.jpg",
    },
  },
  {
    id: '250608',
    path: "/blog/250608",
    preview: {
      author: RUPALI,
      date: "06-08-2025",
      articleTitle: "今日本協會開第二屆第二次理監事聯席會暨道一道務會議",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250608/1.jpg",
      shortIntro:
        "今日本協會開第二屆第二次理監事聯席會暨道一道務會議，感謝何理事長對近期協會完成各項任務的嘉勉;感謝陳領導點傳師對道務的關心與鼓勵，感謝諸位理監事出席和諸會員與壇主人才列席開會。感謝慈悲！",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250608/1.jpg",
    },
  },
  {
    id: '250525',
    path: "/blog/250525",
    preview: {
      author: RUPALI,
      date: "05-25-2025",
      articleTitle: "道一經典班邀請蘇春香與黃坤紅二位講師慈悲講「金剛經-正信希有分第六」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250525/1.jpg",
      shortIntro:
        "道一經典班邀請蘇春香與黃坤紅二位講師慈悲講「金剛經-正信希有分第六」；感謝陳領導點傳師致詞鼓勵；講師云：「正信:正信者即對正道起信之謂也。」因為華嚴經云：「信為道源功德母，長養一切諸善根。」此已說明既聞大道，而更能生信心者，這絕非等閒之人也。「希有」者，因正法之難聞，而信者希有也。修道最大的障礙就是強烈的自我意識。就像影子隨著身體，遇到任何關係到自我的緣境，便會立刻顯現出來。感謝子薰、品妘等前賢輔導兒童班，感謝林太太、陳太太、素柔姐、淑琴等廚務前賢準備豐盛午餐。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250525/1.jpg",
    },
  },
  {
    id: '250508',
    path: "/blog/250508",
    preview: {
      author: RUPALI,
      date: "05-08-2025",
      articleTitle: "道一泰國二天班會廚務了愿",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250508/1.jpg",
      shortIntro:
        "今5/8（四）早上出發到泰國（曼谷），下午約三點抵達萬緣佛堂，感謝黃點傳師、吳點傳師、溫壇主慈悲接機，參駕後即刻討論二天班會之各項廚務準備工作",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250508/1.jpg",
    },
  },
  {
    id: '250420',
    path: "/blog/250420",
    preview: {
      author: RUPALI,
      date: "04-20-2025",
      articleTitle: "馬來西亞勞勿道一壇主人才班",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250420/1.jpg",
      shortIntro:
        "馬來西亞勞勿道一壇主人才班，昨晚正式開始，此班會有新加坡、馬來西亞以及台灣道親們共同參與班；感謝顏點傳師致詞鼓勵，第一節課感謝何點傳師慈悲成全題目：「壇主人才素養」。第二節課由胡壇主主講，題目：「宏展道場光與熱」",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250420/1.jpg",
    },
  },
  {
    id: '250328',
    path: "/blog/250328",
    preview: {
      author: RUPALI,
      date: "03-28-2025",
      articleTitle: "「海外行愿班」暨「祖師紀念活動」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250328/1.jpg",
      shortIntro:
        "今年「海外行愿班」暨「祖師紀念活動」於3/27～3/30，舉行，道一台、新、馬道親於3/26早上09:00在道一聖道院舉辦座談會，中午到板橋遠百「果然匯」聚餐，歡迎國外道親來台參加班會暨祖師紀念活動。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250328/1.jpg",
    },
  },
  {
    id: '250323',
    path: "/blog/250323",
    preview: {
      author: RUPALI,
      date: "03-23-2025",
      articleTitle: "本會今日舉行「第二屆第一次會員大會」暨「理監事」改選。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250323/1.jpg",
      shortIntro:
        "本會今日舉行「第二屆第一次會員大會」暨「理監事」改選，並順利選出第二屆理事長、常務理事、理事、常務監事、監事以及總幹事、財務長等職位。感謝諸位會員出席參加會議。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250323/1.jpg",
    },
  },
  {
    id: '250223',
    path: "/blog/250223",
    preview: {
      author: RUPALI,
      date: "02-23-2025",
      articleTitle: "「社團法人新北市道一關懷協會」第一屆第十七次理監事會議暨「道一」道務會議 暨 道一經典班請胡朝慶壇主慈悲成全，題目「金剛經-如是我閒分第一」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250223/1.jpg",
      shortIntro:
        "今日早上10:30召開「社團法人新北市道一關懷協會」第一屆第十七次理監事會議暨「道一」道務會議，感謝陳理事致詞讚美去年大家的用心並期望未來協助各項工作都能推動順利。感謝諸位理監事出席與諸位會員列席參加會議。今年首次「道一經典班邀請胡朝慶壇主慈悲成全，題目「金剛經-如是我閒分第一」感謝陳點傳師慈悲致詞，感謝林太太、劉太太、陳太太、淑琴前賢桂等慈悲準備豐盛的午餐，感謝鈞毅講員等慈悲輔導兒童班會，感謝諸位前賢慈悲參加護持班會。感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250223/1.jpg",
    },
  },
  {
    id: '250131',
    path: "/blog/250131",
    preview: {
      author: RUPALI,
      date: "01-31-2025",
      articleTitle: "道一年初三道一總壇團拜",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250131/1.jpg",
      shortIntro:
        "年初三道一總壇團拜，感謝陳前人慈悲：「巳」也是己，「道」、「自己本性」也、本性本圓，修道去其本無，發揮本有的自性之光，人要圓、事要圓、身要圓、心要圓、性自光明而圓滿。感謝前人慈悲發紅包，何點傳師慈悲發賀年卡，大家互道恭禧、祝新年快樂、道務宏展(自性更圓滿)。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250131/1.jpg",
    },
  },
  {
    id: '250129',
    path: "/blog/250129",
    preview: {
      author: RUPALI,
      date: "01-29-2025",
      articleTitle: "道一龍飛蛇舞報新春、除歲獻供拜大年。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/250129/1.jpg",
      shortIntro:
        "龍飛蛇舞報新春、除歲獻供拜大年。聲聲恭喜笑顏臉、祝福道務展鴻延。感謝何點傳師慈悲以及諸位壇主人才慈悲，回老母的家「道一聖道院」樹林中心佛堂守歲、道喜、拜年並祝福諸位前賢大德「新年快樂、道務宏展！」",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/250129/1.jpg",
    },
  },
  {
    id: '241222',
    path: "/blog/241222",
    preview: {
      author: RUPALI,
      date: "12-22-2024",
      articleTitle: "道一經典班邀請胡朝慶壇主慈悲成全，題目「皇母十誡-第十誡與總結」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241222/1.jpg",
      shortIntro:
        "道一經典班邀請胡朝慶壇主慈悲成全，題目「皇母十誡-第十誡與總結」，感謝陳點傳師慈悲致詞，感謝莊太太、胡太太、桂媚前賢等慈悲準備豐盛的午餐，感謝美均講師、鈞毅講員等慈悲輔導兒童班會，感謝諸位前賢慈悲參加護持班會。感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241222/1.jpg",
    },
  },
  {
    id: '241219',
    path: "/blog/241219",
    preview: {
      author: RUPALI,
      date: "12-19-2024",
      articleTitle: "玄懋公司12月班會感謝何點傳師慈悲結緣（身心性一貫）",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241219/1.jpg",
      shortIntro:
        "玄懋公司12月班會感謝何點傳師慈悲結緣（身心性一貫）讓今年班會圓滿結束，感謝陳領導點傳師到班指導，以及各位前賢們與公司夥伴們的共同護持班會，感謝上天慈悲與天恩師德。(資料來源~家慶壇主)",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241208/1.jpg",
    },
  },
  {
    id: '241215',
    path: "/blog/241215",
    preview: {
      author: RUPALI,
      date: "12-15-2024",
      articleTitle: "鶯歌劉氏佛堂邀請李瑞慶講師慈悲成全，題目:六祖壇經之「自性真佛偈」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241215/1.jpg",
      shortIntro:
        "鶯歌劉氏佛堂邀請李瑞慶講師慈悲成全，題目:六祖壇經之「自性真佛偈」，感謝陳點傳師和何點傳師到壇指導。內容:後代之人，識此偈意，自見本心，自成佛道。 偈曰:「真如自性是真佛，邪見三毒是魔王，邪迷之時魔在舍，正見之時佛在堂。性中邪見三毒生，即是魔王來住舍，正見自除三毒心，魔變成佛真無假。法身報身及化身，三身本來是一身，若向性中能自見，即是成佛菩提因。本從化身生淨性，淨性常在化身中，性使化身行正道，當來圓滿真無窮。婬性本是淨性因，除婬即是淨性身，性中各自離五欲，見性剎那即是真。今生若遇頓教門，忽悟自性見世尊，若欲修行覓作佛，不知何處擬求真。 若能心中自見真，有真即是成佛因，不見自性外覓佛，起心總是大癡人。 頓教法門今已留，救度世人須自修，報汝當來學道者，不作此見大悠悠。」",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241208/1.jpg",
    },
  },
  {
    id: '241208',
    path: "/blog/241208",
    preview: {
      author: RUPALI,
      date: "12-08-2024",
      articleTitle: "道一綜合班第一節課邀請黃子瑄講員分享心得，題目：「人性是如何迷失的」。第二節課邀請李瑞慶講師慈悲成全，題目：「性理心法、正法延長-(法意延長)」。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241208/1.jpg",
      shortIntro:
        "道一綜合班第一節課邀請黃子瑄講員分享心得，題目：「人性是如何迷失的」。第二節課邀請李瑞慶講師慈悲成全，題目：「性理心法、正法延長-(法意延長)」。感謝陳點傳師慈悲致詞鼓勵~內容~人性是如何迷失的？一、物慾太重。2、自私自利。3三、以非為是。道德經：五色令人目盲；五音令人耳聾？；五味令人口爽；馳騁畋獵，令人心發狂；難得之貨，令人行妨；是以聖人為腹不為目，故去彼取此。求道得明師一指、止於至善、在親民、在明明德。知止而後能静、靜而後很定。如何止？遵守「十條大願」+「十五條佛規」。第二節課內容:過去講三寶和三法印等道理極為平常、聽眾極能接受、法意甚是深入。三科門是什麼？五藴、十八界、十二入(觸)。明師一指，超生了死，生死大事如何了，三根普級、法意平等、實修者皆能超生了死。「傳道」是直指心性，不是明心見性，先得而後修；「傳法」是歸依三寶、明心見性。幸受真傳、同註天盤、赦罪容寬、南無阿彌十佛天元--歸依佛的根本心、根本法。傳道是攝受三寶、傳法是明心見性--這要傳承延續。感謝得利講員、美均講師、鈞毅前賢慈悲輔導青少年班以及兒童班，感謝莊太太、胡太太、芳宜和桂媚等前賢了愿廚務準備豐盛的午餐。感謝諸位前賢參加護持班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241208/1.jpg",
    },
  },
  {
    id: '241201',
    path: "/blog/241201",
    preview: {
      author: RUPALI,
      date: "12-01-2024",
      articleTitle: "土城「胡氏佛堂」班會邀請曾隆泰講師慈悲成全，題目:「八正道」。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241201/1.jpg",
      shortIntro:
        "土城「胡氏佛堂」班會邀請曾隆泰講師慈悲成全，題目:「八正道」。感謝何點傳師慈悲結語:人要能陰陽調和、呼吸順暢、前下後升、水火既濟、動靜一如、動功而後有靜、靜極方能入定，此即是八正道所謂之「正定」也。課程內容:前言~呂祖說：「一二三四五，二人守一土，解開其中意，便是西來祖。」一、八正道之意:正見、正思惟、正語、正業、正命、正精進、正念、正定。二、淺說八正道:1、正見：見苦集滅道四諦之理而明之也。華嚴經:正見牢固、離諸妄見。2、正思惟:思四諦理，離諸雜念。3、正語:不必言而言謂之多言，多言招尤。不當言而言謂之盲言，盲言賈禍。4、正業:正確的行為。5、正命:不親近五邪命(1)、詐現異相。(2)、自說功能。(3)、占相吉凶。(4)、高聲現威。(5)、所說得利以動人心。6、正精進:~濟公老師慈語:「非道勿為、自利利他。」增補資料:7、正念:能專心憶念善法。8、正定:正確的禪定，集中意志和精神，使散亂的身心住於一境。感謝諸位前賢參加護持班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241201/1.jpg",
    },
  },
  {
    id: '241128',
    path: "/blog/241128",
    preview: {
      author: RUPALI,
      date: "11-28-2024",
      articleTitle: "玄懋公司11月班會感謝廖文闊講師慈悲結緣主題（人生智慧）",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241128/1.jpg",
      shortIntro:
        "玄懋公司11月班會感謝廖文闊講師慈悲結緣主題（人生智慧），感謝何點傳師慈悲到班指導。(資料來源-家慶壇主)",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241128/1.jpg",
    },
  },
  {
    id: '241124',
    path: "/blog/241124",
    preview: {
      author: RUPALI,
      date: "11-24-2024",
      articleTitle: "社團法人新北市道一關懷協會第一屆第十六次理監事會議暨「道一」道務會議",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241124/1.jpg",
      shortIntro:
        "今日早上10:30召開「社團法人新北市道一關懷協會」第一屆第十六次理監事會議暨「道一」道務會議，感謝何常務理事致詞說明協會與興毅基金會之相互配合以及未來展望的推動方向，鼓勵諸位會員多多參與各項活動。感謝諸位理監事出席與諸位會員列席參加會議。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241124/1.jpg",
    },
  },
  {
    id: '241116',
    path: "/blog/241116",
    preview: {
      author: RUPALI,
      date: "11-16-2024",
      articleTitle: "古坑班會邀請陳厚源講師慈悲成全，題目:「學道的省思」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241116/1.jpg",
      shortIntro:
        "古坑班會邀請陳厚源講師慈悲成全，題目:「學道的省思」，感謝何點傳師慈悲結語:入班聽法非耳聞，乃心在焉性主宰而得知也。修心~則用善心知佛性，性心身一貫、精氣神聚頂、五氣能朝元、身體必康健。前言:修道人若無法遵守佛規禮節，猶如竹藍提水，白忙一場(白了工)。為什麼要求道~認識天時:2025~2032是天道地弟子最好發揮的時期，修道要超凡入聖，得心性解脫、才能超凡入聖。一、超生了死:1、尊敬仙佛~你們尊敬仙佛，不應該只是尊敬那看得到的仙佛，還要尊敬你心中的那個仙佛。你們都很尊敬佛堂裡的仙佛，可是你心中的那尊自性佛呢？只要你們所做的一切，内不離自性，外不悖佛性，一切合乎天理，一切不違背良心，那才是真正的尊敬仙佛啊。關聖帝君慈示:「佛規禮節不遵守,欲上天梯難上加難。」漢鍾離大仙說:「小看這十五條佛規,它是非常好的天梯。」變相觀空為受得，果中猶自不全真，圓明初發成無漏，三類分身息苦輪。八識規矩頌:「浩浩三藏不可窮，淵深七浪境為風;受熏持種根身器，去後來先作主公。」達摩祖師云:「:初守一竅知定靜，收回六識到中庭，築基煉己次第進，方可採藥把丹昇，移爐煉鼎時正知，文武火候老嫩分，沐浴溫養週天定，二六時中不留停，小週煉至大週定，三十六宮都是春。」動身發語獨為最、引滿能招業力牽。 2、齋莊中正:齋莊中正並不只是頭髮整齊、衣服端莊、外表莊嚴，而是要你內心莊重，眼、耳、鼻、舌、身、意也全要莊重。換句話說，你能做到內心全無雜念，莊重自持，那才是真正的齋莊中正。感謝陳壇主夫妻準備古坑咖啡、水果（有吃夠有抓)、點心以及午餐享用。感謝諸位前賢慈悲參加護持班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241116/1.jpg",
    },
  },
  {
    id: '241110',
    path: "/blog/241110",
    preview: {
      author: RUPALI,
      date: "11-10-2024",
      articleTitle: "綜合班第一節課邀請何良純講員分享心得-「修道修心」-第二節邀請陳彦宸講師慈悲成全，題目:「同心同德齊修辦。」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241110/1.jpg",
      shortIntro:
        "道一綜合班第一節課邀請何良純講員分享心得-「修道修心」-第二節邀請陳彦宸講師慈悲成全，題目:「同心同德齊修辦。」感謝陳點傳師慈悲致詞。修道修心內容:《襲明集》~性與命為什麼花這麼多時間來佛堂？因為我想要成為更好的人。吳老前人慈語:「修性不修命，業纏不離形，風中立旗桿，如何能定中。修命不修性,陰雨見晴空，一旦夕陽下，未知陰雨情。」一切法門皆是為了常保本來無一物的「本性」。不要被外表所囿，找回原本的自心。同心同德齊修辦內容~三慧:智「慧」、恩「惠」、力「匯」。修辦精神、應時應運、武王伐紂、同心成事、認定目標、了愿回鄉、眾志成城、素位而行。修辦合一齊頭並進；修道是為了回家，辦道是為了帶更多人回家。修與辦:修:懺悔與感恩。辦:願力與業力。最好是愿力要走在業力前。感謝子薰前賢慈悲邀請朱前賢(店長)、鈞毅等前賢引導兒童班學習做雞蛋糕~感謝兩位林太太、劉太太、素柔姐、淑琴前賢慈悲準備豐盛的午餐。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241110/1.jpg",
    },
  },
  {
    id: '241103',
    path: "/blog/241103",
    preview: {
      author: RUPALI,
      date: "11-03-2024",
      articleTitle: "土城胡氏佛堂邀請曾隆泰講師慈悲成全，題目：「四聖諦」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241103/1.jpg",
      shortIntro:
        "土城胡氏佛堂邀請曾隆泰講師慈悲成全，題目：「四聖諦」感謝陳點傳師蒞臨指導。內容:佛陀成道後，三度演說四聖諦妙義，稱之為「三轉法輪」。第一次為「示相轉」，指示「此是苦，逼迫性；此是集，招感性；此是滅，可證性；此是道，可修性」；第二次為「勸修轉」，勸示「此是苦，汝應知；此是集，汝應斷；此是滅，汝應證；此是道，汝應修」；第三次為「自證轉」，證示「此是苦，我已知；此是集，我已斷；此是滅，我已證；此是道，我已修」。佛陀三轉法輪的用意是要我們能夠辨識苦的本質。在辨識後，要親身體驗修行八正道，離苦得樂，證得圓滿的安樂。關聖帝君慈訓:人生難免八大苦，生不得息費心田，終日奔馳為利祿，為誰辛苦為誰儲。關聖帝君慈訓:人老氣衰智力失，守門看戶苦孤獨，兩鬚如霜骸骨瘦，一家之事難做主。滅諦:~成道~母訓：冬不挺夏不臭容顏端正、此本是臭皮囊得證金身。六祖壇經云:善知識，後代得吾法者，將此頓教法門，於同見同行，發願受持，如事佛故，終身而不退者，定入聖位。感謝諸位前賢護持參加班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241103/1.jpg",
    },
  },
  {
    id: '241027',
    path: "/blog/241027",
    preview: {
      author: RUPALI,
      date: "10-27-2024",
      articleTitle: "道一聖道院邀請劉茂炳講師慈悲成全:「皇母十誡-第八誡」第二節課邀請黃坤紅講師慈悲成全:「皇母十誡-第九誡」。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241027/1.jpg",
      shortIntro:
        "道一聖道院經典班第一節課邀請劉茂炳講師慈悲成全:「皇母十誡-第八誡」第二節課邀請黃坤紅講師慈悲成全:「皇母十誡-第九誡」。萬古奇緣奧妙多、三期末劫開天科、三元運會龍華選、考拔佛子證大羅。八誡告原佛子心酸肉麻、觀一觀眾兒女不惺塵沙--寫一篇血書語望兒惺吧、這非是勸世文閒談閒言、為兒女將心血操得碎亂、諸佛子牢牢記廣闡佛法。九誡告原佛子血淚下滴、只為我皇胎子膽掉心提、富貴人他倒把貧窮來拜、道德展貫全球中外同一、大智的原佛子速速下手、莫等待舟行江補漏則遲。感謝鈞毅前賢、子瑄前賢慈悲輔導兒童班會，感謝洪大嫂、吳太太、陳太太、劉太太準備豐盛午餐。感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241027/1.jpg",
    },
  },
  {
    id: '241001',
    path: "/blog/241001",
    preview: {
      author: RUPALI,
      date: "10-01-2024",
      articleTitle: "陳領導點傳師、何點傳師慈悲帶領台灣道親前往馬來西亞檳城了愿九皇齋義賣活動",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/241001/1.jpg",
      shortIntro:
        "陳領導點傳師、何點傳師慈悲帶領台灣道親前往馬來西亞檳城了愿九皇齋義賣活動，從06：30就有人購買，人潮開始增加早、午晚餐-宵夜更是絡繹不絕，餐桌客滿，無位，工作的前賢用餐只有就席而坐；青年精英更是用心經營，大家了愿歡喜，忙得不亦悅乎！辛苦了！",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/241001/1.jpg",
    },
  },
  {
    id: '24921',
    path: "/blog/24921",
    preview: {
      author: RUPALI,
      date: "9-21-2024",
      articleTitle: "道親聯誼9/21(六)-9/22(日)二日遊暨敬老活動",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24921/1.jpg",
      shortIntro:
        "道親聯誼9/21(六)-9/22(日)二日遊暨敬老活動-早上道一聖道院(巷口)出發→明德水庫-七里香玻瑰森林-午餐禪廚蔬食餐廳。感謝陳領導點傳師、何點傳師慈悲致詞鼓勵並祝福旅途愉快，大家平安、順利，感謝宏祥旅行社何奐毅先生、弘道彥宸講師精心籌劃安排、感謝財務劉前賢配合各項活動支援，感謝諸位前賢踴躍參與活動。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24921/1.jpg",
    },
  },
  {
    id: '24901',
    path: "/blog/24901",
    preview: {
      author: RUPALI,
      date: "9-01-2024",
      articleTitle: "土城胡氏佛堂班會，題目:「由六祖壇經論一貫道的修持」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24901/1.jpg",
      shortIntro:
        "9/1(日)土城胡氏佛堂有班會，邀請李瑞慶師講師慈悲成全，題目:「由六祖壇經論一貫道的修持」。感謝何點傳師慈悲結語：三極一貫之理、性.心.身一貫、體.相.法(體.相.用)一貫。內容:《無相頌》非常重要，我們要在日常生活中去一點一點落實。「心平何勞持戒，行直何用修禪。恩則孝養父母，義則上下相憐。讓則尊卑和睦，忍則眾惡無喧。若能鑽木出火，淤泥定生紅蓮。苦口的是良藥，逆耳必是忠言。改過必生智慧，護短心內非賢。日用常行饒益，成道非由施錢。菩提只向心覓，何勞向外求玄。聽說依此修行，西方只在目前。」修道~心地無非自性戒，心地無痴自性慧，心地無亂自定。世間法若看不清楚、你如何修出世間法?壇經:「菩提自性本來清静、但用此心直了成佛。」修持定慧三大命題:無念為宗、無住為體、無住為本。感謝諸位前賢護持參加班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24901/1.jpg",
    },
  },
  {
    id: '24825',
    path: "/blog/24825",
    preview: {
      author: RUPALI,
      date: "8-25-2024",
      articleTitle: "道一經典班，題目:「皇母訓子十誡-6、7誡」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24825/1.jpg",
      shortIntro:
        "道一經典班，邀請黃坤紅講師慈悲成全，題目:「皇母訓子十誡-6、7誡」感謝何點傳師慈悲致詞鼓勵：國內道場修辦大家都很用心、也很盡力，希望日後有機會也能至海外參加修辦。感謝鈞毅、良純、子薰慈悲引導兒童以及輔導幼幼小明友，感謝廚務林太太、劉太太、素柔姐與淑琴前賢慈悲用心準備午餐。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24825/1.jpg",
    },
  },
  {
    id: '24822',
    path: "/blog/24822",
    preview: {
      author: RUPALI,
      date: "8-22-2024",
      articleTitle: "福地福人居、心田心性栽」最好的風水是人",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24822/1.jpg",
      shortIntro:
        "玄懋公司心靈講座，感謝陳點傳師慈悲到堂指導，感謝何點傳師慈悲結語鼓勵,感謝胡壇主結緣，題目:「福地福人居、心田心性栽」最好的風水是人。人間最好的風水就是——行善積德。這個道理看似簡單，實際上「大道至簡」。改變不了外在的環境，何不改變自己的行為，從自身做起，每一個身、口、意不對別人造成傷害，多行善，這不是在改變自己身上的風水了嗎？結論:世人盡知穴在山，豈知穴在方寸間。好山好水世不欠，苟非其人尋不見。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24822/1.jpg",
    },
  },
  {
    id: '24818',
    path: "/blog/24818",
    preview: {
      author: RUPALI,
      date: "8-18-2024",
      articleTitle: "總壇經典班、長青班道一服務",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24818/1.jpg",
      shortIntro:
        "8/18(日)總壇經典班、長青班道一服務：有您們真好!感謝鄧浴華、吳真漢、劉茂炳、鄧琴健、洪憲郎、胡朝慶、陳麗珠、李素娥、李淑華等前慈悲以及青年精英:美均、沛玲、子萱、鈞毅、軍霆等前賢慈悲了愿，分工合作、盡心盡力、圓滿完成任務，大家了愿快樂，真的!有您們真好!感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24818/1.jpg",
    },
  },
  {
    id: '24811',
    path: "/blog/24811",
    preview: {
      author: RUPALI,
      date: "8-11-2024",
      articleTitle: "新北市道一關懷協會第一屆第15次理監事聯席會議以及道務會議",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24811/1.jpg",
      shortIntro:
        "今早舉行社團法人新北市道一關懷協會第一屆第15次理監事聯席會議以及道務會議。感謝各位理監事、諸位會員以及道親踴躍出席參與開會；同時並舉行中元普渡。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24811/1.jpg",
    },
  },
  {
    id: '24804',
    path: "/blog/24804",
    preview: {
      author: RUPALI,
      date: "8-04-2024",
      articleTitle: "胡氏佛堂今(8/4)日班會，邀請杜素華講師慈悲成全，題目:「三寶修持」與辛勝華講師慈悲分享「金剛波羅蜜經-莊嚴淨土分第十、無為福勝分第十一」。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24804/1.jpg",
      shortIntro:
        "土城胡氏佛堂今(8/4)日班會，第一節課邀請杜素華講師慈悲成全，題目:「三寶修持」。第二節課邀請辛勝華講師慈悲分享「金剛波羅蜜經-莊嚴淨土分第十、無為福勝分第十一」。感謝李瑞慶壇主慈悲做結語。第一節課內容:佛法不是知識，它是智慧，知識是從分別心顯現出來的，智慧是從清淨心顯現出來的。自性三寳：皈依佛(覺)→覺而不迷，福慧雙修。皈依法(正)→正法無我，遠離煩惱。皈依僧(淨)→自性清淨，無欲無求。真正有智慧的人，永遠不會被困難所迷惑，更不會因為前行路上的障礙而停下向前遇進的脚步。第二節內容:第十分重點~離相度生、無住行施、無所住而生其心。佛告須菩提：「於意云何?如來昔在然燈佛所，於法有所得不?」「不也，世尊!如來在然燈佛所，於法實無所得。」「須菩提!於意云何?菩薩莊嚴佛土不?」「不也，世尊!何以故?莊嚴佛土者，即非莊嚴，是名莊嚴。」「是故，須菩提！諸菩薩摩訶薩應如是生清淨心，不應住色生心，不應住聲香味觸法生心，應無所住而生其心。無為福勝分第十一內容：「須菩提！如恆河中所有沙數，如是沙等恆河，於意云何？是諸恆河沙，寧為多不？」須菩提言：「甚多。世尊！但諸恆河，尚多無數，何況其沙？」~----感謝諸位前賢慈悲護持參加班。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24804/1.jpg",
    },
  },
  {
    id: '24728',
    path: "/blog/24728",
    preview: {
      author: RUPALI,
      date: "7-28-2024",
      articleTitle: "邀請辛勝華講師慈悲分享:「金剛般若波羅蜜經-持誦心得」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24728/1.jpg",
      shortIntro:
        "7/28(日)早上道一聖道院綜合班，邀請辛勝華講師慈悲分享:「金剛般若波羅蜜經-持誦心得」。感謝何點傳師慈悲致詞；分享內容從「法會因由分第一」--「莊嚴淨土分第十」。感謝鈞毅前賢、純良前賢慈悲輔導兒童班，感謝廚務二位陳太、劉太、吳太、洪大嫂和二位女兒們慈悲準備豐盛的午餐。感謝諸位前賢護持會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24728/1.jpg",
    },
  },
  {
    id: '247141',
    path: "/blog/247141",
    preview: {
      author: RUPALI,
      date: "7-14-2024",
      articleTitle: "「九皇齋義賣」工作協調座談會",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/247141/1.jpg",
      shortIntro:
        "今(14)日下午舉行「九皇齋義賣」工作協調座談會，感謝何點傳師慈悲重點提示；其各項工作有一、切高麗菜、蘿蔔絲餅、攪拌。二、包水煎包、紅豆餅。三、包蘿蔔絲餅。四、煎水煎包、蘿蔔絲餅、紅豆餅。五、煮紅豆餅以及炒餡料。六、準備包裝袋子(紙袋外裝塑膠袋)。七、麵粉攪拌等。感謝諸位前賢慈悲出席參與座談。感謝慈悲！",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/247141/1.jpg",
    },
  },
  {
    id: '24714',
    path: "/blog/24714",
    preview: {
      author: RUPALI,
      date: "7-14-2024",
      articleTitle: "邀請何美融講師慈悲分享講題:「菩提道次第廣論」-廣論入門基礎-（觀功念恩最幸福)",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24714/1.jpg",
      shortIntro:
        "道一綜合班，第一節邀請何美融講師慈悲分享講題:「菩提道次第廣論」-廣論入門基礎-（觀功念恩最幸福)。感謝何點傳師慈悲致詞：以亞歷山大的三個遺言-「第一、我的棺材必須由最忠心的醫生抬回去。」「第二、當我的棺材運向墳墓時，沿途的道路必須灑滿我寶庫里的金銀財寶。」「第三、我的雙手必須放在棺材外面，讓大家都看得見。」鼓勵同修；世上一切是虛空，無論你這一生積累了多少財富，有多麼了不起，終究還是回歸到虛空裡；所以同修要能共辦，真修實煉。内容：觀功念恩最幸福。快樂不是物質的享受而是是心靈上的自在。人之所以會痛苦，是因為想錯了，人之所以會快樂，是因為想對了。三種看待的人生:觀過念怨、觀光念閒、觀功念恩。觀:看見別人長處。恩:記住別人對我的好。找不到功德、看不到恩的時候，要從沙堆中撿金粉。觀功念恩的方法:一、找功德。二、學念恩。三、勤修隨喜。四、轉過患為功德。第二節邀請李瑞慶講師慈悲成全，無題-由「痛」說起「痛」除了肉體的「痛」、還有精神上的「痛」即是魔考。自心無非自性戒，傳承-傳統不可少。修行是要改變自己的習性、脾氣毛病。明「業識」-十二因緣(前世造因，今生受、今生造因，來世果)，所以要改變觀念、習性是天道的重點。定慧等持-「止、觀」，「心經」由「觀.」開始-觀自在菩薩---般若婆羅蜜多時---渡一切苦厄。安住心、別欲主宰業力；「隨緣消舊業，莫更造新殃」，我們要懂得，隨逆境、隨惡緣，消舊業；隨順境、隨善緣。感謝鈞毅前賢、良純前賢慈悲用心輔導兒童。感謝二位陳太太、洪太太、劉太太、吳太太慈悲準備豐盛的午餐。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24714/1.jpg",
    },
  },
  {
    id: '24708',
    path: "/blog/24708",
    preview: {
      author: RUPALI,
      date: "7-8-2024",
      articleTitle: "做「香椿醬」，準備馬來西亞北海「九皇齋」義賣水煎包及蘿蔔絲餅配料",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24708/1.jpg",
      shortIntro:
        "今早到古坑「陳氏佛堂」做「香椿醬」，準備馬來西亞北海「九皇齋」義賣水煎包及蘿蔔絲餅配料用，感謝陳明芳壇主夫妻一早就砍香椿待用。感謝慈悲！",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24708/1.jpg",
    },
  },
  {
    id: '24707',
    path: "/blog/24707",
    preview: {
      author: RUPALI,
      date: "7-7-2024",
      articleTitle: "胡氏佛堂班會邀請劉茂炳講師慈悲成全:題目:「羅漢道與菩薩道」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24707/1.jpg",
      shortIntro:
        "今7/7(日)土城胡氏佛堂班會邀請劉茂炳講師慈悲成全:題目:「羅漢道與菩薩道」，感謝陳領導點傳師慈悲結語。前言：由十八羅漢說起-由阿羅漢(自覺、自渡-了脫生死)至菩薩道(渡人、覺他-求道是回天之路成佛、成菩薩)說起；四聖諦-八正道至修持(須陀洹、斯陀含、阿那含、阿羅漢這是小乘)佛法中修行次第的四個階段(果位)，合起來稱為「四果羅漢」。也就是說，要修到「阿羅漢」這個層次，要先後經過這四個階段。也就是修習佛法的人達到了脫生死，即不再生死輪迴就叫阿羅漢，佛經(教)塑有十八羅漢。從凡夫位開始發心修行，必須歷經十信、十住、十行、十迴向、十地、等覺、妙覺等，總共有五十二階位的菩薩修行，才能次第的圓滿佛道的修證。感謝諸位前賢護持參加班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24707/1.jpg",
    },
  },
  {
    id: '24627',
    path: "/blog/24627",
    preview: {
      author: RUPALI,
      date: "6-27-2024",
      articleTitle: "玄懋公司六月班會感謝廖文闊講師慈悲結緣（人生智慧）。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24627/1.jpg",
      shortIntro:
        "玄懋公司六月班會感謝廖文闊講師慈悲結緣（人生智慧）感謝陳點傳師慈悲到班指導、感謝何點傳師慈悲結語，感謝公司夥伴們以及道親同修參加共修-護持班會。(資料來源-家慶壇主)",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24627/1.jpg",
    },
  },
  {
    id: '24623',
    path: "/blog/24623",
    preview: {
      author: RUPALI,
      date: "6-23-2024",
      articleTitle: "道一聖道院今日班會邀請胡朝慶講師講：「皇母十誡-第五誡與第一誡至第五誡的小結論。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24623/1.jpg",
      shortIntro:
        "道一聖道院今日班會邀請胡朝慶講師講：「皇母十誡-第五誡與第一誡至第五誡的小結論。感謝陳領導點傳師慈悲致詞：「能忍為君子、堅忍為豪傑、化忍為聖賢、無生忍為佛」-前五誡小結。第一誡：靈性來源，回歸須「求真與力行」。第二誡：道脈傳承,超生了死，回歸本源。第三誡:道為尊，萬物皆由此生。第四誡：認清真假，借假修真，同登理天。第五誡：三期末劫，真道真解脫。感謝莊太太(春敏)、胡太太(素娥)、芳宜前賢和桂媚前賢準備豐盛午餐。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24623/1.jpg",
    },
  },
  {
    id: '24615',
    path: "/blog/24615",
    preview: {
      author: RUPALI,
      date: "6-15-2024",
      articleTitle: "李瑞慶講師慈悲心成全「六祖壇經」-般若品第二",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24615/1.jpg",
      shortIntro:
        "鶯歌劉氏佛堂今日班會，第一節課邀請李瑞慶講師慈悲心成全「六祖壇經」-般若品第二。續上次課程-諸佛剎土，盡同虛空。世人妙性本空，無一法可得；自性真空，亦復如是。真空是能容納一切、不取、不著、不染。心若不空則智慧不能增長也！善知識！莫聞吾說空便即著空。吳老前人慈語:「道親不親形同路人，道場分割正本立分，有辦無修本末不倒置，是非不辨所為何事。」第二節課邀請陳彦宸講師慈悲成全，題目：「溝通、合作和正向影響力」。溝通的重要性：一、良好的溝通傳達正確重要的訊息、提高效率。二、引發共鳴的溝通增進共識、促進和諧合作與團結(道務上要正向溝通、要能上下溝通，大家都能藉事來煉心，就能和諧與團結)。三、正向溝通增進彼此的了解、化解矛盾與衝突。有情緒的時候，運用STOP的原則，停下來、深呼吸、觀察自己、從新表達。感謝劉壇主夫妻慈悲招待與服務，感謝美均講師與懿萱前賢慈悲準備色香味豐盛的午餐。感謝諸位前賢參加護持班會，感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24615/1.jpg",
    },
  },
  {
    id: '246151',
    path: "/blog/246151",
    preview: {
      author: RUPALI,
      date: "6-15-2024",
      articleTitle: "古坑「陳氏佛堂」今日班會，邀請曾勇龍講師慈悲成全",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/246151/1.jpg",
      shortIntro:
        "古坑「陳氏佛堂」今日班會，邀請曾勇龍講師慈悲成全，題目:「微明集-道與教」-道與教相、教義。道之與教,好比一個成熟了的鮮桃，外層色香味俱佳是桃肉，這比作教，而具生機性能之桃仁,深藏在桃肉桃核裡面，故吃不掉桃肉、不見桃核,不剥掉桃核,不見桃仁，這桃仁便喻作不顯於相的道。我們修道都在參閱三教經典，做為道是教的中心文證，和修道進階之憑藉。教法非心法，語言文字皆非道，所以我們修道要以教法來圓滿心法，這便是事所必然的了。感謝陳壇主夫妻準備古坑有名的咖啡水果享用，以及豐盛的午餐。感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/246151/1.jpg",
    },
  },
  {
    id: '24609',
    path: "/blog/24609",
    preview: {
      author: RUPALI,
      date: "6-9-2024",
      articleTitle: "第一屆第十四次理監事會議暨「道一聖道院」召開道務會議",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24609/1.jpg",
      shortIntro:
        "今(6/9)日早上「社團法人新北市道一關懷協會」召開第一屆第十四次理監事會議暨「道一聖道院」召開道務會議。感謝諸位理監事、會員以及壇主人才踴躍出(列)席參加會議。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24609/1.jpg",
    },
  },
  {
    id: '24602',
    path: "/blog/24602",
    preview: {
      author: RUPALI,
      date: "6-2-2024",
      articleTitle: "土城「胡氏佛堂」班會邀請陳彦宸講師慈悲成全，題目：「道化人生」。",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24602/1.jpeg",
      shortIntro:
        "土城「胡氏佛堂」班會邀請陳彦宸講師慈悲成全，題目：「道化人生」。感謝陳領導點傳師到堂指導、感謝何點傳師慈悲做結語：吳老前人慈語:『人生的關卡是名利情愛、生死跟放下，這是道化人生應該突破的地方」。道化人生-前言:想要有好的房子，更重要的是要有好的理念，身心要純正而不邪，房子要整潔而不亂。所以要能有「斷捨離」的心識與意念。如何「斷捨離？」從自己做起~用三步驟打造理想生活:一、要先「捨」:金碧峰禪師與玉缽，因執玉缽而不得解脫。要能捨去一些所執所愛的「有形與我(心物」的東西。二、進行「斷」:斷捨離做哪些準備？1.一日丟一物、一進一出。2.加入收納整理社團。3.先整理自己可以完全控制的區域。4.不先買收納用品。5.觀察自己的生活動線、使用習慣。三、體悟「離」：大限來時，要無牽無掛，能捨離這個「肉體」嗎？能體悟到「靈性」是、無形、無色、無味、無相，「自性」是無所染著的，要能「大澈大悟」進入「純淨」的體證。 結論：心量要廣大，要能繫緣修心、藉事練心、隨處養心。感謝諸位前賢護持參加班會。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24602/1.jpeg",
    },
  },
  {
    id: '24526',
    path: "/blog/24526",
    preview: {
      author: RUPALI,
      date: "5-26-2024",
      articleTitle: "泰國-上半年度「壇主人才班」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24526/1.jpeg",
      shortIntro:
        "5/26(日)泰國-上半年度「壇主人才班」，從08:45獻供開始，感謝陳領導點傳師慈悲「致詞」和「結語」鼓勵大家，修道要把興毅精神傳承下來、辦道要能團結、扶圓補缺、活潑應事，我們才能更精進。感謝何點傳師慈悲成全，題目：「興毅重光、重光興毅」-「興毅重光」在台灣是永繼師尊師母道脈~(重建總壇接道脈-2008)，總壇是根(大家的根)，「重光興毅」要延續正法、興毅大生命不倒、自我完善。感謝黃伶珠點傳師慈悲鼓勵我們(台灣及新加坡道親)來泰國了愿服務和廚務。感謝諸位點傳師到堂關心，感謝楊登詠講師慈悲成全，題目:「光大興毅道風-誠、正、樸、毅、忠、信」，感謝王潤源講師慈悲成全，題目:「引保師關懷道親」。感謝翻譯:陳月嬌講師、呂佳憲講師、張錦城講師，大家法喜充滿、頗有所得。感謝劉美均講師慈悲輔導兒童學習道理，感謝台灣、新加坡前賢以誠心、用心、愛心與道心共同承擔完成任務。感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24526/1.jpeg",
    },
  },
  {
    id: '24525',
    path: "/blog/24525",
    preview: {
      author: RUPALI,
      date: "5-25-2024",
      articleTitle: "泰國-萬緣佛堂「講員培訓班」",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24525/1.jpeg",
      shortIntro:
        "5/25(六)泰國-萬緣佛堂「講員培訓班」，從08:45獻供開始，感謝陳材源領導點傳師慈悲致詞、感謝何明修點傳師慈悲成全、感謝黃伶珠點傳師做結語以及諸位點傳師到堂關心，感謝王潤源講師慈悲、楊登詠慈悲成全，感謝翻譯:張瑞妝講師、陳月嬌講師、呂佳憲講師、張錦城講師；至最後一堂課「綜合討論」，大家分組、心得報告，法喜充滿、頗有所得。感謝劉美均講師慈悲輔導兒童學習，感謝台灣、新加坡前賢以誠心、愛心與道心的了愿精神做服務工作和豐盛的餐食享用。感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24525/1.jpeg",
    },
  },
  {
    id: '24519',
    path: "/blog/24519",
    preview: {
      author: RUPALI,
      date: "5-19-2024",
      articleTitle: "興毅(忠信)北區全家福班",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24519/1.jpeg",
      shortIntro:
        "興毅(忠信)北區全家福班，於今日在道明聖堂與道弘舉行，道一聖道院多位壇主人才參與班會，諸多道親並了愿兒童班輔導員、青少年班輔導員以長青班、壇主人才班執禮、茶水毛巾、環境整理等各項服務工作，並從旁聞法，大家法喜充滿了愿快樂。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24519/1.jpeg",
    },
  },
  {
    id: '24518',
    path: "/blog/24518",
    preview: {
      author: RUPALI,
      date: "5-18-2024",
      articleTitle: "古坑「陳氏佛堂」班會",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/24518/1.jpg",
      shortIntro:
        "古坑「陳氏佛堂」班會邀請何明修點傳師慈悲成全，題目:「認理實修」。內容「道真、理真、天命真」，吳老前人慈悲：「天道真正的原則,真正的精神,就是崇尚「真理」，也就是我們常講的:〔道真、理真、天命真。〕〔天命真〕非常非常重要，對第一寶來說，真天命可以給你點開(玄關竅、智慧門)，假天命點不開。〔理真〕，在天道叫做「性理心法」是以心印心之法。三教經典最精髓的地方，叫明心見性、修心煉性、存心養性，一個心，一個性。良心是本性的作用。「人之初，性本善」本性是一個靜，發出的作用，叫做良心，這個不用學。〔教化與真理〕、「你要做好人、不要做壞事、要順父母⋯這不是靠宗教力量，真正覺悟的話你會做，不需要特別講。若明白道理，您自己會做，這就是...良心、〔道〕。「靈性復活，良心再現」這是真理，叫「性理心法」。天道就是直接從「性理心法」入手。〔道真〕、真在什麼地方？〔道有道統〕我們應該是根據這條路走。所以知道真理以後、我們就要「認理實修」",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/24518/1.jpg",
    },
  },
  {
    id: '2',
    path: "/blog/2",
    preview: {
      author: RUPALI,
      date: "5-4-2024",
      articleTitle: "道親聯誼暨母親節康乃馨獻花活動",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/2/1.jpeg",
      shortIntro:
        "社團法人新北市道一關懷協會」道一聖道院，今日於桃園市虎頭山公園舉辦「道親聯誼暨母親節康乃馨獻花活動」，感謝上天慈悲賜給我們一個風和日麗的好天氣，感謝兩位點傳師慈悲領導與關心，感謝彦宸講師和美均講師帶來輕鬆有趣的團康活動，感謝諸位道親準備咖啡、水果、點心、茶水及各式各樣美食饗宴，感謝諸位道親對道一各項班會活動的支持，希望未來協會與道一道務(壇務)能更順遂更宏展。感謝慈悲！",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/2/1.jpeg",
    },
  },
  {
    id: '3',
    path: "/blog/3",
    preview: {
      author: RUPALI,
      date: "4-28-2024",
      articleTitle: "彌勒家族歡喜樂團",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/3/1.jpg",
      shortIntro:
        "感謝「彌勒家族歡喜樂團」蒞臨「社團法人新北市道一關懷協會」道一聖道院，帶來蓬勃熱情、有道氣的帶動唱表演。感謝慈悲！",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/3/1.jpg",
    },
  },
  {
    id: '4',
    path: "/blog/4",
    preview: {
      author: RUPALI,
      date: "4-25-2024",
      articleTitle: "4/25(四)玄懋公司心靈成長班會",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/4/1.jpg",
      shortIntro:
        "4/25(四)玄懋公司心靈成長班會，邀請「黃啟山」講師慈悲成全，題目:「 智者樂水、仁者樂山」，內容：孔子曰:「智者若何?仁者若何?」子路對曰:「智者使人知己，仁者使人愛己。」子貢對曰:「智者知人，仁者愛人。」顏回對曰:「智者自知，仁者自愛。」知者樂水、仁者樂山。也知者動、仁者靜。知者樂、仁者壽。《論語離雍》。有山有水有遠景、能動能靜方為道、既樂且壽活神仙、智者仁者兩相兼。感謝陳點傳師慈悲蒞臨指導，感謝何點傳師慈悲結語：「天長地久」。感謝諸位道親同仁護持班會，感謝慈悲！",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/4/1.jpg",
    },
  },
  {
    id: '5',
    path: "/blog/5",
    preview: {
      author: RUPALI,
      date: "4-25-2024",
      articleTitle: "第四次「社團法人新北市道一關懷協會」會員大會",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/5/1.jpg",
      shortIntro:
        "今早10:30召開第一屆第四次「社團法人新北市道一關懷協會」會員大會，出席踴躍，會中討論並順利通過各項提案。稍後繼續開「道一道務會議」大家踴躍發言討論做了決議並確定多項道(事)務工作。感謝慈悲!",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/5/1.jpg",
    },
  },
  {
    id: '6',
    path: "/blog/6",
    preview: {
      author: RUPALI,
      date: "2-25-2024",
      articleTitle: "第一屆第十三次理監事聯席會議",
      tags: "社團法人新北市道一關懷協會",
      thumbnail: "/public/images/blog/6/1.jpg",
      shortIntro:
        "今早10:30本協會召開「第一屆第十三次理監事聯席會議」。出席、列席非常踴躍、經提案討論後做出最好決議案。之後開「道一道務會議」，道親提出很多、多項建設性的建議.感謝道一協會會員以及道親同修們參與會議。",
      category: "道一",
    },
    seo: {
      keywords:
        "社團法人新北市道一關懷協會",
      ogImage: "/public/images/blog/6/1.jpg",
    },
  }, 
];

export const SORTED_ARTICLES_BY_DATE = ARTICLES_LIST.sort((a, b) =>
  new Date(a.preview.date) > new Date(b.preview.date) ? -1 : 1
);
